// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится на два без остатка)
Console.Write("Введите число ");
int a = int.Parse(Console.ReadLine());
if ( a % 2 == 0) {
    Console.WriteLine ("Число чётное");
}
else
{Console.WriteLine ("Число нечётное");
    }

